tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "staircase/tap", "https://code.byted.org/staircase/tap"
brew "jpeg-xl"
brew "harfbuzz"
brew "openjdk@21"
brew "bazel"
brew "btop"
brew "delve"
brew "deno"
brew "dotnet@6"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-lfs"
brew "go"
brew "kubernetes-cli"
brew "lua"
brew "neovim"
brew "node"
brew "node@18"
brew "openjdk@11"
brew "openjdk@17"
brew "oxker"
brew "python-setuptools"
brew "rustup"
brew "scrcpy"
brew "stow"
brew "tmux"
brew "trash"
brew "tree"
brew "virtualenv"
brew "wget"
brew "yazi"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "staircase/tap/staircase"
cask "anaconda"
cask "android-platform-tools"
cask "arc"
cask "betterdisplay"
cask "cursor"
cask "discord"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "gcloud-cli"
cask "hammerspoon"
cask "kitty"
cask "telegram"
cask "wezterm"
cask "zed"
vscode "angular.ng-template"
vscode "anysphere.cursorpyright"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "connor4312.nodejs-testing"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "esbenp.prettier-vscode"
vscode "folke.vscode-monorepo-workspace"
vscode "golang.go"
vscode "manuthebyte.dynamic-icon-theme"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
